{
    "nombre": "Bryan Maciel de Almeida",
    "edad": 18,
    "ubicación": "Rosario, Argentina",
    "objetivos": "Mi objetivo es posicionarme como un desarrollador completo y estratégico, capaz de entregar soluciones digitales que combinen alto rendimiento técnico, visión de producto e impacto real en los negocios. Busco constantemente proyectos desafiantes que me permitan expandir mi capacidad de análisis, programación y arquitectura de sistemas, siempre enfocándome en la eficiencia, escalabilidad e innovación. No me interesa ejecutar tareas de forma mecánica: mi compromiso es entender el contexto, anticipar problemas y proponer mejoras que generen verdadero valor. Deseo trabajar en entornos que valoren la velocidad, adaptabilidad y resultados tangibles, no simplemente el cumplimiento de procesos. Estoy en constante formación, tanto en el área técnica —con énfasis en back-end, integración de APIs, inteligencia artificial y automatizaciones— como en habilidades estratégicas como la gestión ágil de proyectos y el pensamiento orientado al producto. En los próximos años, pretendo liderar iniciativas que superen los estándares comunes de desarrollo, implementando soluciones inteligentes que desafíen el mercado tradicional y que me posicionen como una referencia en tecnología e innovación. A mediano plazo, aspiro a participar en proyectos globales, especialmente en el ecosistema de optimización de sistemas, desarrollo de plataformas escalables y creación de nuevos productos digitales.",
    "universidad": "UNR-FCEIA",
    "carrera": "Ciencias de la Computación",
    "cargo": "Desarrollador Front-end",
    "habilidades": [
        "Java",
        "JavaScript",
        "TypeScript",
        "Python",
        "HTML",
        "CSS",
        "React",
        "Tailwind CSS",
        "Node.js (básico)",
        "Git",
        "GitHub",
        "Vercel",
        "Firebase (básico)",
        "MySQL (básico)",
        "APIs",
        "Computación en la Nube (básico)"
    ],
    "contacto": {
        "correo": "bryanmacieldealmeida06@gmail.com",
        "github": "Bryan-M-Almeida",
        "linkedin": "https://www.linkedin.com/in/bryan-maciel-de-almeida",
        "telefonoBrasil": "+55 22 99780-5082",
        "telefonoArgentina": "+54 9 341 752-2488"
    },
    "imagen": "imagenes/foto.jpeg",
    "experiencias": [
        "Desarrollo de Sitios Web Responsivos",
        "Creación de Sistemas en JavaScript",
        "Proyectos de Automatización y Cálculo de Impuestos en Python",
        "Diseño de Interfaces con HTML y CSS",
        "Integración de APIs y Consumo de Datos",
        "Desarrollo de Juegos Simples con Lógica de Programación",
        "Organización de Proyectos y Optimización de Código"
    ],
    "proyectos": [
        "Portafolio",
        "Pokédex",
        "Sitio de Restaurante (Clon de Ludwig)",
        "Linktree Simple",
        "Calculadora de Impuestos",
        "Juego de Memoria",
        "Organizador de Tareas",
        "Gestor Inteligente",
        "Lista de Deseos",
        "Modo Oscuro",
        "Sistema de Vuelo",
        "Tarot (Proyecto para Cliente)",
        "Proyecto de Impuestos en Python",
        "Sitio inspirado en Nvidia",
        "Máquina Expendedora (Python)",
        "Login y Registro Responsivo",
        "Código de Botón con Posición Aleatoria"
    ],
    "disponibleParaContratacion": true,
    "aprendiendoActualmente": [
        "APIs REST",
        "Back-end con Node.js",
        "Bases de Datos",
        "Desarrollo de Juegos",
        "React",
        "SQL"
    ]
}